// ޖޫން 11 ވަނަ ދުވަހު އަވަހާރަވި ރައްޔިތުންގެ މަޖިލީހުގެ ކުރީގެ މެމްބަރު އަދި ނިޝާން އިއްޒުއްދީނުގެ އިއްޒަތުގެ ވެރިޔާ ލަގަބު އަރުވާފައިވާ ކުރީގެ މިނިސްޓަރ މާފަންނު ދޫރެސް އަބްދުﷲ ޖަމީލަކީ ދައުލަތަށާއި މުޅި ގައުމުގެ ޚިދުމަތްތެރިއެއް ކަމަށް ރައީސް އިބްރާހީމް މުހައްމަދު ސޯލިހު ވިދާޅުވެއްޖެއެވެ.
// ޢަބްދުﷲ ޖަމީލް އަވަހާރަވީ އެ ދުވަހުގެ ހެނދުނުގެ ވަގުތެއްގައި މާފަންނު ދޫރެސްގައެވެ. އަވަހާރަވިއިރު ޢުމުރުފުޅަކީ 87 އަހަރެވެ. އަދި ރަސްމީ އިއްޒަތުގައި އޭނާގެ ޖަނާޒާ ހަމަ އެ ދުވަހު ވަނީ ބާއްވައިފައެވެ.

// ރައީސް ވަނީ ޖަމީލު އާއިލާއާ ބައްދަލުކުރައްވައި އެ މަރްހޫމްގެ އަގުހުރި ހިދުމަތްތަކުގެ ހަނދާންތައް އައު ކުރައްވައި ޢާއިލާއަށް ތައުޒިޔާ ވިދާޅުވެފައެވެ.

// ޖަމީލްގެ އާއިލާގެ ބޭފުޅުންނާ ރައީސަ ބައްދަލުކުރެއްވީ މިއަދު ހެނދުނު ރައީސް އޮފީހުގައެވެ.

// މި ބައްދަލުކުރެއްވުމުގައި ރައީސް ދެއްކެވި ވާހަކަފުޅުގައި 54 އަހަރުގެ ދިގު މުއްދަތަކަށް ޢަބްދުﷲ ޖަމީލް ދަޢުލަތަށް ކޮށްދެއްވާފައިވާ ޚިދުމަތްތަކުގެ ހަނދާންތައް އައުކުރެއްވިއެވެ. އޭނާގެ ޚިދުމަތްތަކުގެ ހަނދާންތައް އައުކުރައްވަމުން ރައީސް ވިދާޅުވީ ގެއްލިގެން އެދިޔައީ ދަޢުލަތާއި މުޅި ގައުމުގެ ހިދުމަތްތެރިއެއް ކަމަށެވެ.

// ރައީސް ވަނީ ސަރުކާރާއި އެމަނިކުފާނުގެ އަމިއްލަ ނަންފުޅުގައި ޢާއިލާއަށް ތައުޒިޔާ ވިދާޅުވެފައެވެ. މި ބައްދަލުކުރެއްވުމުގައި އެ މަރްޙޫމްގެ ޢާއިލާއިން ވަނީ މަރްޙޫމް ޢަބްދުﷲ ޖަމީލް (ނ.ޢ.ޢ.ވ)ގެ ޚިދުމަތުގެ އަގުވަޒަންކުރައްވައި ސަރުކާރުން ކުރައްވަމުން ގެންދަވާ ކަންކަން ޝުކުރުވެރިކަމާއެކު ފާހަގަކުރައްވާފައެވެ.

// މި ބައްދަލުކުރެއްވުމަށްފަހު ރައީސް ވަނީ ޢަބްދުﷲ ޖަމީލްގެ ހަނދާނުގައި ރައީސް އޮފީހުގައި ހުޅުވި ތަޢުޒިޔާގެ ދަފުތަރުގައި ސޮއިކުރައްވާފައެވެ. މި ދަފްތަރުގައި އެންމެ ފުރަތަމަ ސޮއިކުރެއްވީ ރައީސް ސޯލިހެވެ. އެއަށްފަހު ނައިބް ރައީސް ފައިސަލް ނަސީމެވެ.

// ތަޢުޒިޔާގެ ދަފުތަރުގައި ރައީސުލްޖުމްހޫރިއްޔާ ލިޔުއްވި ބަޔާނުގައި ވަނީ ޢަބްދުﷲ ޖަމީލް (ނ.ޢ.ޢ.ވ)ގެ އަވަހާރަވުމަކީ މުޅި ޤައުމަށް ލިބުނު ހިތާމައެއްކަން ފާހަގަކުރައްވައި މަރްޙޫމްގެ 54 އަހަރުގެ ޤައުމީ ޚިދުމަތުގައި ފާހަގަކުރެވިގެން ދަނީ ކޮންމެ ކަމެއްގައިވެސް ދިވެހި ދަޢުލަތާއި ރައްޔިތުންގެ މަސްލަޙަތަށް އިސްކަންދެއްވި ބޭފުޅެއްގެ ގޮތުގައިކަން ފާހަގަކުރައްވާފައިވެއެވެ.

// އަދި ދިވެހިރާއްޖޭގެ ޤައުމީ ހަޔާތުގަޔާއި ބަރުލަމާނީ ހަޔާތުގައި އަދާކުރައްވާފައިވާ ޚިދުމަތްތެރި ދައުރަށް ރައީސުލްޖުމްހޫރިއްޔާ ވަނީ އިޚްލާޞްތެރިކަމާއެކު ޝުކުރު އަދާކުރައްވާފައެވެ. ތަޢުޒިޔާގެ ދަފުތަރުގައި ރައީސުލްޖުމްހޫރިއްޔާ ލިޔުއްވި ބަޔާން ނިންމަވާލައްވާފައި ވަނީ މަރްޙޫމް ޢަބްދުﷲ ޖަމީލް (ނ.ޢ.ޢ.ވ)ގެ ފުރާނަފުޅަށް ހެޔޮ ރަޙްމަތްލައްވައި ސުވަރުގޭގެ ދާޢިމީ ނިޢުމަތް މިންވަރުކުރެއްވުމަށް ދުޢާ ދަންނަވަމުންނެވެ.

// އަލްމަރްޙޫމް ޢަބްދުﷲ ޖަމީލް (ނ.ޢ.ޢ.ވ)ގެ ހަނދާނުގައި ރައީސުލްޖުމްހޫރިއްޔާގެ އޮފީހުގައި ހުޅުވި ތަޢުޒިޔާގެ ދަފުތަރުގައި މަރްޙޫމްގެ ޚިދުމަތްތަކުގެ ހަނދާންތައް އައުކުރައްވައި ރައީސުލްޖުމްހޫރިއްޔާގެ ނައިބުވެސް ވަނީ ބަޔާނެއް ލިޔުއްވާފައެވެ.

// އަލްމަރްޙޫމް ޢަބްދުﷲ ޖަމީލް (ނ.ޢ.ޢ.ވ) ދެމިއޮތުމުގެ ޢާލަމަށް ދަތުރުކުރެއްވުމުގެ ހިތާމައިގައި، ޖޫން 12ވާ ހޯމަ ދުވަހުގެ މެންދުރު ފަހު. 1:00އިން ފެށިގެން ތިންދުވަސް ވަންދެން ދިވެހި ޤައުމީ ދިދަ ބައިދަނޑިއަށް ވަނީ ތިރިކޮށްފައެވެ. އަދި މަރްޙޫމް ފަސްދާނުލެވުނީ ރަސްމީ ޢިއްޒަތުގައި ގަލޮޅު ސަހަރާގައެވެ.

//   var keyMap = {
//     q: "ް",
//     w: "އ",
//     e: "ެ",
//     r: "ރ",
//     t: "ތ",
//     y: "ޔ",
//     u: "ު",
//     i: "ި",
//     o: "ޮ",
//     p: "ޕ",
//     a: "ަ",
//     s: "ސ",
//     d: "ދ",
//     f: "ފ",
//     g: "ގ",
//     h: "ހ",
//     j: "ޖ",
//     k: "ކ",
//     l: "ލ",
//     z: "ޒ",
//     x: "×",
//     c: "ޗ",
//     v: "ވ",
//     b: "ބ",
//     n: "ނ",
//     m: "މ",
//     Q: "ޤ",
//     W: "ޢ",
//     E: "ޭ",
//     R: "ޜ",
//     T: "ޓ",
//     Y: "ޠ",
//     U: "ޫ",
//     I: "ީ",
//     O: "ޯ",
//     P: "÷",
//     A: "ާ",
//     S: "ށ",
//     D: "ޑ",
//     F: "ﷲ",
//     G: "ޣ",
//     H: "ޙ",
//     J: "ޛ",
//     K: "ޚ",
//     L: "ޅ",
//     Z: "ޡ",
//     X: "ޘ",
//     C: "ޝ",
//     V: "ޥ",
//     B: "ޞ",
//     N: "ޏ",
//     M: "ޟ",
//     ",": "،",
//     ";": "؛",
//     "?": "؟",
//     "<": ">",
//     ">": "<",
//     "[": "]",
//     "]": "[",
//     "(": ")",
//     ")": "(",
//     "{": "}",
//     "}": "{",
//   };

// creating a wordlist from the paragraph using the keymap
// dhivehi to latin dhivehi
export const wordlist = [
  "wasqlu",
  "minivanq",
  "hafusq",
  "jUnq 11 vana duvahu wavahAravi",
  "wadi niCAnq wiwqzuwqdInuge wiwqzatuge veriyA lagabu",
  " wEnAge Kidumatqtakuge handAnqtawq wawukurawqvamunq rawIsq vidALuvI gewqligenq wediyawI daWulatAwi muLi gawumuge hidumatqteriwewq kamaSeve",
  "marqHUmqge Kidumatqtakuge handAnqtawq",
  "wawukurawqvamunq rawIsq vidALuvI gewqligenq wediyawI daWulatAwi muLi gawumuge hidumatqteriwewq kamaSeve",
  "marqHUmqge Kidumatqtakuge handAnqtawq",
];
